#### Terraform Plan 📖

```hcl
Acquiring state lock. This may take a few moments...
aws_iam_role.lambda_exec_role: Refreshing state... [id=TodoList-lambda-role]
aws_apigatewayv2_api.http_api: Refreshing state... [id=jthu0zvbu5]
aws_dynamodb_table.todo_list_table: Refreshing state... [id=TodoList]
aws_cognito_user_pool.user_pool: Refreshing state... [id=sa-east-1_TJ2hNKNGG]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=TodoList-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_cognito_user_pool_client.app_client: Refreshing state... [id=28229sdm71m3s9hj4j35rgql84]
aws_iam_policy.dynamodb_policy: Refreshing state... [id=arn:aws:iam::730335563853:policy/TodoList-dynamodb-policy]
aws_lambda_function.update_delete_list_lambda: Refreshing state... [id=TodoList-UpdateDeleteList]
aws_lambda_function.get_list_lambda: Refreshing state... [id=TodoList-GetList]
aws_lambda_function.create_item_lambda: Refreshing state... [id=TodoList-CreateItem]
aws_lambda_function.create_list_lambda: Refreshing state... [id=TodoList-CreateList]
aws_lambda_function.list_items_lambda: Refreshing state... [id=TodoList-ListItems]
aws_apigatewayv2_authorizer.cognito_authorizer: Refreshing state... [id=titabx]
aws_iam_role_policy_attachment.dynamodb_attachment: Refreshing state... [id=TodoList-lambda-role/arn:aws:iam::730335563853:policy/TodoList-dynamodb-policy]
aws_lambda_permission.api_gtw_permission_update_delete: Refreshing state... [id=AllowAPIGatewayToInvokeUpdateDelete]
aws_apigatewayv2_integration.update_list_integration: Refreshing state... [id=vmiyui7]
aws_apigatewayv2_integration.delete_list_integration: Refreshing state... [id=uabcx92]
aws_lambda_permission.api_gtw_permission_create: Refreshing state... [id=AllowAPIGatewayToInvokeCreate]
aws_apigatewayv2_integration.create_list_integration: Refreshing state... [id=qj50and]
aws_lambda_permission.api_gtw_permission_list_items: Refreshing state... [id=AllowAPIGatewayToInvokeListItems]
aws_apigatewayv2_integration.list_items_integration: Refreshing state... [id=ki46ah1]
aws_lambda_permission.api_gtw_permission_create_item: Refreshing state... [id=AllowAPIGatewayToInvokeCreateItem]
aws_apigatewayv2_integration.create_item_integration: Refreshing state... [id=y3ewfis]
aws_lambda_permission.api_gtw_permission_get: Refreshing state... [id=AllowAPIGatewayToInvokeGet]
aws_apigatewayv2_integration.get_list_integration: Refreshing state... [id=djjtcgi]
aws_apigatewayv2_route.delete_list_route: Refreshing state... [id=jnzd56a]
aws_apigatewayv2_route.update_list_route: Refreshing state... [id=zn3ctad]
aws_apigatewayv2_route.create_list_route: Refreshing state... [id=wsly04o]
aws_apigatewayv2_route.list_items_route: Refreshing state... [id=25f3csf]
aws_apigatewayv2_route.create_item_route: Refreshing state... [id=gygle6e]
aws_apigatewayv2_route.get_list_route: Refreshing state... [id=80cf8l0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_api.http_api will be updated in-place
  ~ resource "aws_apigatewayv2_api" "http_api" {
        id                           = "jthu0zvbu5"
        name                         = "TodoList-api-rest"
      ~ tags                         = {} -> (known after apply)
      ~ tags_all                     = {} -> (known after apply)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.create_item_lambda will be updated in-place
  ~ resource "aws_lambda_function" "create_item_lambda" {
        id                             = "TodoList-CreateItem"
      ~ last_modified                  = "2025-10-17T22:35:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z3m8M4Nl/2DBK/FQaNRFC0+yR5//2HS/37LKjYfpIA8=" -> "wq9OE6vlSmJktEUkfQ89vO85R3FmWs3BiM8YQ2IYTWU="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.create_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "create_list_lambda" {
        id                             = "TodoList-CreateList"
      ~ last_modified                  = "2025-10-17T22:35:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z3m8M4Nl/2DBK/FQaNRFC0+yR5//2HS/37LKjYfpIA8=" -> "wq9OE6vlSmJktEUkfQ89vO85R3FmWs3BiM8YQ2IYTWU="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.get_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "get_list_lambda" {
        id                             = "TodoList-GetList"
      ~ last_modified                  = "2025-10-17T22:35:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z3m8M4Nl/2DBK/FQaNRFC0+yR5//2HS/37LKjYfpIA8=" -> "wq9OE6vlSmJktEUkfQ89vO85R3FmWs3BiM8YQ2IYTWU="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.list_items_lambda will be updated in-place
  ~ resource "aws_lambda_function" "list_items_lambda" {
        id                             = "TodoList-ListItems"
      ~ last_modified                  = "2025-10-17T22:34:55.141+0000" -> (known after apply)
      ~ source_code_hash               = "Z3m8M4Nl/2DBK/FQaNRFC0+yR5//2HS/37LKjYfpIA8=" -> "wq9OE6vlSmJktEUkfQ89vO85R3FmWs3BiM8YQ2IYTWU="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.update_delete_list_lambda will be updated in-place
  ~ resource "aws_lambda_function" "update_delete_list_lambda" {
        id                             = "TodoList-UpdateDeleteList"
      ~ last_modified                  = "2025-10-17T22:35:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z3m8M4Nl/2DBK/FQaNRFC0+yR5//2HS/37LKjYfpIA8=" -> "wq9OE6vlSmJktEUkfQ89vO85R3FmWs3BiM8YQ2IYTWU="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Pusher: @Deyvidy-Alves, Action: `pull_request`*